Public Attributes | List of all members
API_IFCDifference Struct Reference
IFC Data Access
Contains an IFC Difference. More...
#include <APIdefs_IFC.h>
 Public Attributes
GS::Array< API_IFCEntityDescriptor >  | newIFCEntities
New IFC entities.
GS::Array< API_IFCEntityDescriptor >  | modifiedIFCEntities
Modified IFC entities.
GS::Array< API_IFCEntityDescriptor >  | deletedIFCEntities
Deleted IFC entities.
bool  | isValid
Detailed Description
Contains an IFC Difference.
Since
Archicad 26
Remarks
This structure is used in ACAPI_IFC_GetIFCDifference and ACAPI_IFC_GetIFCDifferenceState.
Member Data Documentation
◆ deletedIFCEntities
 API_IFCDifference::deletedIFCEntities
Deleted IFC entities.
◆ isValid
 API_IFCDifference::isValid
It is false if IFCDifference Generator result is indeterminate.
◆ modifiedIFCEntities
 API_IFCDifference::modifiedIFCEntities
Modified IFC entities.
◆ newIFCEntities
 API_IFCDifference::newIFCEntities
New IFC entities.